using System.Collections;
using System.Collections.Generic;
using UnityEngine;
using UnityEngine.UI;


//出題される文字列がまとめてあるクラス。出題の順番、表示もこのクラスでやる
public class TypingDictionary : MonoBehaviour
{
    //確実に二次元配列的なやつで単語帳を作っていきたいから泥臭いけどString型の2次元配列にした。
    public string[,] dic = {
        //{"本文（漢字あり）","よみかた（ひらがな）"}
        //文字の幅とスペースの幅が完全に一致しないのでローマ字の部分は全角で表示したい。
        //ただUNITY側の文字の取得とかでひっかかりそうなので怖い。
        //単語単体は「。」を付けないことにする。
        //実際に誰かが言ったことあるセリフは「。」を付けようと思う。

        //これは[1]でひらがなにしてあとから文字に応じて文字列を作ったほうがいいのかも。でもとにかく眠すぎるからまた今度

        //朝霞高校ラグビー部編
            {"ラグビーフットボール","らぐびーふっとぼーる"},
            {"埼玉県立朝霞高等学校","さいたまけんりつあさかこうとうがっこう"},
            {"進学重視型単位制高校","しんがくじゅうしがたたんいせいこうこう"},
            {"朝霞高校５４期生","あさかこうこう５４きせい"},            
            {"朝霞高等学校","あさかこうとうがっこう"},
            {"武蔵野の土に根を張り","むさしののつちにねをはり"},
            {"武蔵野の空に広がる","むさしののそらにひろがる"},
            {"武蔵野の昼に憧れ","むさしののひるにあこがれ"},
            {"武蔵野の夜に夢見る","むさしののよるにゆめみる"},
            {"朝霞高校ラグビー部","あさかこうこうらぐびーぶ"},
            {"戦う青軍団","たたかうあおぐんだん"},
            {"朝霞高校ラグビー部PUBG同好会","あさかこうこうらぐびーぶＰＵＢＧどうこうかい"},
            {"朝霞高校ラグビー部茶道研究会","あさかこうこうらぐびーぶさどうけんきゅうかい"},
            {"朝霞高校ラグビー部軟式野球チーム","あさかこうこうらぐびーぶなんしきやきゅうちーむ"},
            {"朝霞高校ラグビー部バレーボールチーム","あさかこうこうらぐびーぶばれーぼーるちーむ"},
            {"朝霞高校ラグビー部水泳チーム","あさかこうこうらぐびーぶすいえいちーむ"},
            {"ラグビー部ＰＵＢＧ組合","らぐびーぶＰＵＢＧくみあい"},
            {"朝霞高校ラグビー部ビリヤード同好会","あさかこうこうらぐびーぶびりやーどどうこうかい"},
            {"新生ラグビー部","しんせいらぐびーぶ"},
            {"ごじゅうよんきのみんな","ごじゅうよんきのみんな"},

            {"フォワードとバックス","ふぉわーどとばっくす"},
            {"重戦車、プロップ","じゅうせんしゃ、ぷろっぷ"},
            {"スクラムの要、フッカー","すくらむのかなめ、ふっかー"},
            {"チームいちの巨人、ロック","ちーむいちのきょじん、ろっく"},
            {"超絶運動量の持ち主、フランカー","ちょうぜつうんどうりょうのもちぬし、ふらんかー"},
            {"暴れん坊、ナンバーエイト","あばれんぼう、なんばーえいと"},
            {"つなぎ役、スクラムハーフ","つなぎやく、すくらむはーふ"},
            {"司令塔、フライハーフ","しれいとう、ふらいはーふ"},
            {"切り込み隊長、センター","きりこみたいちょう、せんたー"},
            {"韋駄天、ウィング","いだてん、うぃんぐ"},
            {"最後の砦、フルバック","さいごのとりで、ふるばっく"},
            {"縁の下の力持ち、マネージャー","えんのしたのちからもち、まねーじゃー"},

            {"ラグビーでは１チーム１５人です","らぐびーでは１ちーむ１５にんです"},
            {"ラグビーではグラウンドに３０人の選手がいます","らぐびーではぐらうんどに３０にんのせんしゅがいます"},
            {"試合終わればノーサイド","しあいおわればのーさいど"},
            {"サイン、ハチノス","さいん、はちのす"},
            {"サイン、サルサ","さいん、さるさ"},
            {"ポップとガット","ぽっぷとがっと"},
            {"誰も使わないマーク","だれもつかわないまーく"},
            {"モールの操作は難しい","もーるのそうさはむずかしい"},
            {"手繋ぎ鬼で分裂","てつなぎおにでぶんれつ"},
            {"マネージャーも楽じゃない","まねーじゃーもらくじゃない"},
            {"試合中に脳震盪","しあいちゅうにのうしんとう"},
            {"試合中に足が攣る","しあいちゅうにあしがつる"},
            {"ユニットで別れて練習する","ゆにっとでわかれてれんしゅうする"},
            {"スタイルで着替える","すたいるできがえる"},
            {"スクラムで押し切る","すくらむでおしきる"},
            {"ステップを切る","すてっぷをきる"},
            {"ラダーからのミニハードル","らだーからのみにはーどる"},
            {"ボールを落としても諦めるな","ぼーるをおとしてもあきらめるな"},
            {"ノックオンからのスクラム","のっくおんからのすくらむ"},
            {"ノットロールアウェイ","のっとろーるあうぇい"},
            {"アーリーエンゲージ","あーりーえんげーじ"},
            {"クラウチ、バインド、セット","くらうち、ばいんど、せっと"},
            {"ボール落としてターンオーバー","ぼーるおとしてたーんおーばー"},
            {"うっかりスローフォワード","うっかりすろーふぉわーど"},
            {"順目と逆目","じゅんめとぎゃくめ"},
            {"敗因は理解と体力の不足","はいいんはりかいとたいりょくのふそく"},
            {"ラインアウトで競る","らいんあうとでせる"},
            {"ラインアウトの心理戦","らいんあうとのしんりせん"},
            {"部長相澤","ぶちょうあいざわ"},{"副部長牧野","ふくぶちょうまきの"},
            {"フォワードリーダー横山","ふぉわーどりーだーよこやま"},
            {"バックスリーダー菅野","ばっくすりーだーすがの"},
            {"宴会部長本田","えんかいぶちょうほんだ"},{"体操部長山下","たいそうぶちょうやました"},
            {"タックルパック担いでリレー","たっくるぱっくかついでりれー"},
            {"タイヤ押しリレー","たいやおしりれー"},
            {"馬の姿勢","うまのしせい"},
            {"オフサイド","おふさいど"},
            {"オンサイド","おんさいど"},
            {"ラックは後ろから入ろうね","らっくはうしろからはいろうね"},
            {"ランパスでミス連発","らんぱすでみすれんぱつ"},

            {"１番、榎本朋侑","１ばん、えのもとともゆき"}, {"２番、相澤類","２ばん、あいざわるい"},
            {"３番、関口晃平","３ばん、せきぐちこうへい"}, {"４番、山口裕輝","４ばん、やまぐちゆうき"},
            {"５番、五十嵐晃樹","５ばん、いがらしこうき"}, {"６番、藤岡竜希","６ばん、ふじおかりゅうき"},
            {"７番、井上泰誠","７ばん、いのうえたいせい"}, {"8番、横山将也","８ばん、よこやままさや"},
            {"9番、菅野吏","９ばん、すがのつかさ"}, {"１０番、本田大空","１０ばん、ほんだそら"},
            {"１１番、佐々木航","１１ばん、ささきわたる"}, {"１２番、山下竜征","１２ばん、やましたりゅうせい"},
            {"１３番、二ノ宮勇貴","１３ばん、にのみやゆうき"}, {"１４番、牧野泰治","１４ばん、まきのたいじ"},
            {"１５番、木下優希","１５ばん、きのしたゆうき"}, {"幻の１５番、大塚一晟","まぼろしの１５ばん、おおつかいっせい"},
            {"マネージャー、安達エリカ","まねーじゃー、あだちえりか"}, {"マネージャー、中妻星","まねーじゃー、なかつまあかり"},
            {"顧問、今成卓也","こもん、いまなりたくや"},{"副顧問、近藤博之","ふくこもん、こんどうひろゆき"},
            {"副顧問、堺裕之","ふくこもん、さかいひろゆき"},{"名審判、山田太郎","めいしんぱん、やまだたろう"},
        //
        
        //思い出編
            {"カパオパンゴの悪夢","かぱおぱんごのあくむ"},  
            {"おにぎり争奪じゃんけん大会","おにぎりそうだつじゃんけんたいかい"},
            {"静寂のタッチフット","せいじゃくのたっちふっと"},
            {"ホールドからのガチガチ","ほーるどからのがちがち"},
            {"楽しかった菅平","たのしかったすがだいら"},
            {"地獄の２年合宿","じごくの２ねんがっしゅく"},
            {"山口円盤直撃事件","やまぐちえんばんちょくげきじけん"},
            {"藤岡バッグ悪臭事件","ふじおかばっぐあくしゅうじけん"},
            {"受験の年だけどサマーランドに行こう","じゅけんのとしだけどさまーらんどにいこう"},      
            {"涙の所北戦","なみだのとこきたせん"},
            {"おでんの蓋割ってブラックリスト","おでんのふたわってぶらっくりすと"},
            {"ラインで自撮りを誤爆","らいんでじどりをごばく"},
            {"練習後のＰＫ選手権","れんしゅうごのＰＫせんしゅけん"},
            {"ミカンを発酵させて蜜柑茶を造る","みかんをはっこうさせてみかんちゃをつくる"},
            {"ディーン、怒りの裏拳","でぃーん、いかりのうらけん"},
            {"牛角で七輪を壊す","ぎゅうかくでしちりんをこわす"},
            {"試合中に仲裁役がブチ切れる修羅場","しあいちゅうにちゅうさいやくがぶちぎれるしゅらば"},
            {"いっせいがぐっさんに背負い投げを決める","いっせいがぐっさんにせおいなげをきめる"},
            {"サマーランドで係員にがらが怒られる","さまーらんどでかかりいんにがらがおこられる"},
            {"柔道場フォワード四つん這いダービー","じゅうどうじょうふぉわーどよつんばいだーびー"},
            {"４人でしゃぶしゃぶ１２０皿","４にんでしゃぶしゃぶ１２０さら"},
            {"中庭でお昼ご飯を食べる","なかにわでおひるごはんをたべる"},
            {"道頓堀で最後の打ち上げ","どうとんぼりでさいごのうちあげ"},
            {"校門前でおっさんと口論","こうもんまえでおっさんとこうろん"},
            {"しゃぶ葉で再会","しゃぶようでさいかい"},
            {"OBのせいで最後の部活が台無しになる","ＯＢのせいでさいごのぶかつがだいなしになる"},
            {"川越水上公園でプールに飛び込む","かわごえすいじょうこうえんでぷーるにとびこむ"},
            {"ディズニーシーに行く","でぃずにーしーにいく"},
            {"ダボスで遊ぶ","だぼすであそぶ"},
            {"眠い目擦って朝から体操","ねむいめこすってあさからたいそう"},
            {"けやき会館で引退式","けやきかいかんでいんたいしき"},
            {"卒業式後にみんなでココ壱","そつぎょうごにみんなでここいち"},
            {"水道でメドレー","すいどうでめどれー"},
            {"合宿でバーベキュー","がっしゅくでばーべきゅー"},
            {"空前の第五人格ブーム","くうぜんのだいごじんかくぶーむ"},
            {"グラッチェで大食い勝負","ぐらっちぇでおおぐいしょうぶ"},
            {"伊是名島で民泊","いぜなじまでみんぱく"},
            {"閉村式で涙のお別れ","へいそんしきでなみだのおわかれ"},
            {"スーパーフライデーでサーティーワン","すーぱーふらいでーでさーてぃーわん"},
            {"試合のビデオで流れる口笛","しあいのびでおにながれるくちぶえ"},
            {"人が逮捕される現場に遭遇","ひとがたいほされるげんばにそうぐう"},
            {"廃校にボール飛ばして行方不明","はいこうにぼーるとばしてゆくえふめい"},
            {"急激な股間の激痛","きゅうげきなこかんのげきつう"},
            {"倉庫に閉じ込める","そうこにとじこめる"},
            {"ＯＢ戦の後にラウンドワンでオール","ＯＢせんのあとにらうんどわんでおーる"},
            {"肩組んでお祈りタイム","かたくんでおいのりたいむ"},
            {"後半戦でボコボコにされる","こうはんせんでぼこぼこにされる"},
            {"合宿で誕生日をお祝い","がっしゅくでたんじょうびをおいわい"},
            {"うるさすぎて眠れないハズレ部屋","うるさすぎてねむれないはずれべや"},
            {"チーム分けで現れる地域差","ちーむわけであらわれるちいきさ"},
        //

        //名言編
            {"どした。","どした。"},
            {"なめちょんか。","なめちょんか。"},
            {"それはエッグトマト。","それはえっぐとまと。"},
            {"おまえらがやってるのは弱い者イジメだ！","おまえらがやってるのはよわいものいじめだ！"},
            {"もう帰んね？","もうかえんね？"},
            {"人外ズへようこそ。","じんがいずへようこそ。"},
            {"水中戦だ。","すいちゅうせんだ。"},
            {"理由は先生に言ってあります。","りゆうはせんせいにいってあります。"},
            {"はぁ、疲れたなぁ。","はぁ、つかれたなぁ。"},        
            {"ゆうてゾウ帽筋。","ゆうてぞうぼうきん。"},
            {"頼むから死んでくれ","たのむからしんでくれ"},
            {"ネイマールになりたかった。","ねいまーるになりたかった。"},    
            {"どしたおまえ？","どしたおまえ？"},                  
            {"ケンカしに来た。","けんかしにきた。"},              
            {"モラルを持った勧誘をしろ。","もらるをもったかんゆうをしろ。"},
            {"先生、あれは何？","せんせい、あれはなに？"},
            {"わしらには救えぬものじゃ。","わしらにはすくえぬものじゃ。"},
            {"分かんない！分かんない！分かんない！","わかんない！わかんない！わかんない！"},
            {"ドゥーユーキルミー？","どぅーゆーきるみー？"},
            {"マーボー！","まーぼー！"},
            {"フォッフォ。","ふぉっふぉ。"},
            {"お前らパンパース。","おまえらぱんぱーす。"},
            {"何キレてんのｗちょっと怖いんですけどこの人ｗ","なにきれてんのＷちょっとこわいんですけどこのひとＷ"},
            {"ディーンちゃんディーンちゃん。","でぃーんちゃんでぃーんちゃん。"},
            {"類くんまじいい人","るいくんまじいいひと"},
            {"ＤＯＳＩＴＡ！どした！","ＤＯＳＩＴＡ！どした！"},
            {"水くれ、丸焼きになりそうだ！","みずくれ、まるやきになりそうだ！"},
            {"射線切ってんだろ！","しゃせんきってんだろ！"},
            {"あいつらには人間として欠けてるものがある。","あいつらにはにんげんとしてかけてるものがある。"},
            {"佐々木お前タックルしろよ","ささきおまえたっくるしろよ"},
            {"いや無理っす。怖いっすもんｗ","いやむりっす。こわいっすもんＷ"},
            {"感動するなぁ。","かんどうするなぁ。"},
            {"お前らバス座るなよ","おまえらばすすわるなよ"},
            {"うーそーだーよー！","うーそーだーよー！"},
            {"ノリ悪くね？","のりわるくね？"},
            {"俺の前から消えてくれ","おれのまえからきえてくれ"},
            {"イナズマ","いなずま"},
            {"君、スクラム組んだことある？","きみ、すくらむくんだことある？"},
            {"来てくれたの？ソラー","きてくれたの？そらー"},
            {"ありがとソラー！","ありがとそらー！"},
            {"五十嵐先輩まじカッコいいっス","いがらしせんぱいまじかっこいいっす"},
            {"風が降った","かぜがふった"},
            {"右耳の二ミリ右のミニ右耳","みぎみみのにみりみぎのみにみぎみみ"},
            {"めっちゃキレるやん","めっちゃきれるやん"},
            {"雨に感謝","あめにかんしゃ"},
            {"俺、中澤選手の相棒になりたい","おれ、なかざわせんしゅのあいぼうになりたい"},
            {"ヘルプミー","へるぷみー"},
            {"もう終わりだよ","もうおわりだよ"},
            {"それ俺に言うなよ","それおれにいうなよ"},
            {"僕の方がかっこいいです","ぼくのほうがかっこいいです"},
            {"おい１年！！","おい１ねん！！"},
            {"お客さん！口笛やめてもらえないですかね","おきゃくさん！くちぶえやめてもらえないですかね"},
            {"終わっちゃったー","おわっちゃったー"},
            {"いいぞいいぞー！！","いいぞいいぞー！！"},
        //

        //共通認識編
            {"中原さんまさかの結婚","なかはらさんまさかのけっこん"},
            {"人も運ぶよダッバーワーラー","ひともはこぶよだっばーわーらー"},
            {"榎本と山口は犬猿の仲だ","えのもととやまぐちはけんえんのなかだ"},
            {"ホールドとガチガチの境界線はよく分からない","ほーるどとがちがちのきょうかいせんはよくわからない"},
            {"なんキニ","なんきに"},
            {"ハミタマ","はみたま"},           
            {"１.５キロの噂の脳みそつけ麺","１．５きろのうわさののうみそつけめん"}, 
            {"花に毎日バカヤロー","はなにまいにちばかやろー"},
            {"円盤が飛んでくるグラウンド","えんばんがとんでくるぐらうんど"},
            {"そうじゃ、ないんだぁー！","そうじゃ、ないんだぁー！"},
            {"白ブーデと黒ブーデ","しろぶーでとくろぶーで"},
            {"まさとさんの逆ギレ","まさとさんのぎゃくぎれ"},
            {"やよい軒で死ぬほど食べる","やよいけんでしぬほどたべる"},
            {"ゆうきが３人","ゆうきが３にん"},
            {"ショッショでショ","しょっしょでしょ"},
            {"自転車組と電車組","じてんしゃぐみとでんしゃぐみ"},
            {"狭山工業のグラウンドは体に悪い","さやまこうぎょうのぐらうんどはからだにわるい"},
            {"ミーティングでブチギレ","みーてぃんぐでぶちぎれ"},
            {"初期値だけ見ると強い","しょきちだけみるとつよい"},
            {"受験生の味方、富岡塾","じゅけんせいのみかた、とみおかじゅく"},
            {"所北、疑惑のトライ","とこきた、ぎわくのとらい"},
            {"体育教官室に鍵を借りに行く","たいいくきょうかんしつにかぎをかりにいく"},
            {"雨の日は柔道場練習","あめのひはじゅうどうじょうれんしゅう"},
            {"ジョーさんとまさとさんの大喧嘩","じょーさんとまさとさんのおおげんか"},
            {"爆速の島ニイ","ばくそくのしまにい"},
            {"山田晃幹、捕まる","やまだあきと、つかまる"},
            {"ソファーの下の漫画","そふぁーのしたのまんが"},
            {"松下幸之助の逸話","まつしたこうのすけのいつわ"},
            {"パンチは打たれる前に止めれば大丈夫","ぱんちはうたれるまえにとめればだいじょうぶ"},
            {"天狗ロッヂでお泊まり","てんぐろっぢでおとまり"},
            {"ポケモンＧＯで右往左往","ぽけもんＧＯでうおうさおう"},
            {"新しいスクラムマシーンが届く","あたらしいすくらむましーんがとどく"},
            {"唐揚げ棒が人気","からあげぼうがにんき"},
            {"なりすけ","なりすけ"},
            {"銀だこの看板娘","ぎんだこのかんばんむすめ"},
            {"今成先生の数学勉強会","いまなりせんせいのすうがくべんきょうかい"},
            {"強引な勧誘活動","ごういんなかんゆうかつどう"},
            {"汚かった部室が匠の手によって生まれ変わる","きたなかったぶしつがたくみのてによってうまれかわる"},
            {"トンボでグラウンドを整備する","とんぼでぐらうんどをせいびする"},
            {"部室でウィニングイレブン","ぶしつでうぃにんぐいれぶん"},
            {"人のスマホを勝手に見る","ひとのすまほをかってにみる"},
            {"増殖するえのさん","ぞうしょくするえのさん"},
            {"朝食がマズすぎる件について","ちょうしょくがまずすぎるけんについて"},
            {"階段下で着替える","かいだんしたできがえる"},
            {"３年になるまでは外で着替える","３ねんになるまではそとできがえる"},
            {"牧場でラグビー","ぼくじょうでらぐびー"},
            {"古武術にヒントがある","こぶじゅつにひんとがある"},
        //

        //メンバー編

            //相澤編
                {"努力家、相澤","どりょくか、あいざわ"},
                {"電車内でゲロリ","でんしゃないでげろり"},
                {"東京経済大学","とうきょうけいざいだいがく"},
                {"人の肩に噛みつく","ひとのかたにかみつく"},
                {"人の携帯を口に銜える","ひとのけいたいをくちにくわえる"},
                {"週6で筋トレ","しゅう６できんとれ"},
                {"あ！ゴリラ！","あ！ごりら！"},
                {"顔に山葵を塗ります","かおにわさびをぬります"},
                {"豚レンジャーがクセになる","ぶたれんじゃーがくせになる"},
                {"ジムでアルバイト","じむであるばいと"},
                {"るい","るい"},
                {"ロイロイ","ろいろい"},
                {"妹はマネージャー","いもうとはまねーじゃー"},
                {"カーナビに従って逆走","かーなびにしたがってぎゃくそう"},
                {"バドミントンのラケットを壊す","ばどみんとんのらけっとをこわす"},
                {"まこは秩父出身","まこはちちぶしゅっしん"},
                {"ＢＩＳＨが大好き","ＢＩＳＨがだいすき"},
            //

            //榎本編
                {"寡黙人、榎本","かもくにん、えのもと"},
                {"休み時間におにぎりを食べる","やすみじかんにおにぎりをたべる"},
                {"ひたすら足のトレーニング","ひたすらあしのとれーにんぐ"},
                {"小学生４５人連続誘拐殺人事件","しょうがくせい４５にんれんぞくゆうかいさつじんじけん"},
                {"榎本朋侑はAMONGUSがうまい","えのもとともゆきはＡＭＯＮＧＵＳがうまい"},
                {"部活やめたら激痩せ","ぶかつやめたらげきやせ"},
                {"えのさん","えのさん"},
                {"トモユキじゃなくてムネアキ","ともゆきじゃなくてむねあき"},
                {"上裸の写真がフリー素材","じょうらのしゃしんがふりーそざい"},
            //

            //関口編
                {"偽善者、関口","ぎぜんしゃ、せきぐち"},
                {"プロテインの転売をする","ぷろていんのてんばいをする"},
                {"メンディースマイル","めんでぃーすまいる"},
                {"偽善者の笑顔。","ぎぜんしゃのえがお"},
                {"メンディーチャンス","めんでぃーちゃんす"},
                {"お父さんは国語の先生","おとうさんはこくごのせんせい"},
                {"メンディーの自殺ソング","めんでぃーのじさつそんぐ"},
                {"トウキョウＸ","とうきょうＸ"},
                {"ポテトサラダ丼","ぽてとさらだどん"},
                {"東京電機大学","とうきょうでんきだいがく"},
                {"後輩に醜態を晒す","こうはいにしゅうたいをさらす"},
                {"倒れて笑い者になる","たおれてわらいものになる"},
                {"メンディー","めんでぃー"},
                {"秘技、トイレ封印","ひぎ、といれふういん"},
                {"ザッザ","ざっざ"},
                {"アサセ","あさせ"},
                {"信楽焼と写真撮影","しがらきやきとしゃしんさつえい"},
                {"酒呑太","さけのみふとる"},
                {"数学の試験をすっぽかす","すうがくのしけんをすっぽかす"},
                {"本家とモノマネを聴き比べ","ほんけとものまねをききくらべ"},
                {"入学当時で１０４キロ","にゅうがくとうじで１０４きろ"},
                {"メンディーは最低ライン","めんでぃーはさいていらいん"},
            //

            //山口編
                {"暴君、山口","ぼうくん、やまぐち"},
                {"食堂のドアに頭ゴチン","しょくどうのどあにあたまごちん"},
                {"唐突なキレ","とうとつなきれ"},
                {"車内で教官と大喧嘩","しゃないできょうかんとおおげんか"},
                {"選択Ｆ教室","せんたくＦきょうしつ"},
                {"ワンチン","わんちん"},
                {"根岸を突き飛ばす","ねぎしをつきとばす"},
                {"体育教師の悪口が本人にバレる","たいいくきょうしのわるぐちがほんにんにばれる"},
                {"雪玉当たってマジギレ","ゆきだまあたってまじぎれ"},
                {"ボールタッチ鬼の王","ぼーるたっちおにのおう"},
                {"国士舘大学","こくしかんだいがく"},
                {"冬休みに免許を取る","ふゆやすみにめんきょをとる"},
                {"バイソンはやばい","ばいそんはやばい"},
                {"ぐっさん","ぐっさん"},
                {"スキューバダイビングで海に潜る","すきゅーばだいびんぐでうみにもぐる"},
                {"ベルトを付け間違える","べるとをつけまちがえる"},
                {"身長190cmから放たれる蹴りと拳","しんちょう１９０ＣＭからはなたれるけりとこぶし"},
                {"至近距離からのキラーパス","しきんきょりからのきらーぱす"},
                {"上からボール投げて骨折","うえからぼーるなげてこっせつ"},
                {"チンチンイタイ","ちんちんいたい"},
                {"噛み合わない言語の壁","かみあわないげんごのかべ"},
                {"店員に舌打ちされる","てんいんにしたうちされる"},
                {"入学当時で１９０cm","にゅうがくとうじで１９０ＣＭ"},
                {"薬味入れすぎて白目","やくみいれすぎてしろめ"},
                {"十八番は夢を叶えてドラえもん","おはこはゆめをかなえてどらえもん"},
                {"虫が大嫌い","むしがだいきらい"},
            //  

            //五十嵐編
                {"王子、五十嵐","おうじ、いがらし"},
                {"所北のライバル、みやまさ","とこきたのらいばる、みやまさ"},
                {"趣味、病院。","しゅみ、びょういん。"},
                {"タイヤ押しでごっつに負ける","たいやおしでごっつにまける"},
                {"意外と上手いイガラ１００パーセント","いがいとうまいいがら１００ぱーせんと"},
                {"とにかく明るい五十嵐","とにかくあかるいいがらし"},
                {"店員に悪態をつく","てんいんにあくたいをつく"},
                {"いがきょん","いがきょん"},
                {"森三中大島に激似","もりさんちゅうおおしまにげきに"},
                {"城西大学","じょうさいだいがく"},
                {"お嬢はドイツで留学中","おじょうはどいつでりゅうがくちゅう"},
                {"大学をやめる","だいがくをやめる"},
                {"ガトーショコラを作る","がとーしょこらをつくる"},
                {"合格おめでとう","ごうかくおめでとう"},
                {"がら","がら"},
                {"浦島屋の海鮮亭丼","うらしまやのかいせんていどん"},
                {"犬のパンツ","いぬのぱんつ"},
                {"お父さんに喧嘩の極意を教わる","おとうさんにけんかのごくいをおそわる"},
                {"ファッション流通センターＺＡＲＡ","ふぁっしょんりゅうつうせんたーＺＡＲＡ"},
                {"食事で見栄を張る","しょくじでみえをはる"},
                {"食べられないのは訳ががある","たべられないのはわけがある"},
                {"かき氷を頬張る","かきごおりをほおばる"},
                {"うにょうにょ喋る","うにょうにょしゃべる"},
                {"東京タワーと鉄塔を見間違える","とうきょうたわーとてっとうをみまちがえる"},
                {"改造人間ガラ","かいぞうにんげんがら"},
                {"がらの幸せ太り","がらのしあわせぶとり"},
            //

            //藤岡編
                {"強肩、藤岡","きょうけん、ふじおか"},
                {"肩幅と白靴下がトレードマーク","かたはばとしろくつしたがとれーどまーく"},
                {"部屋の壁に穴を開ける","へやのかべにあなをあける"},
                {"藤岡竜希は声が高くて歌がうまい","ふじおかりゅうきはこえがたかくてうたがうまい"},
                {"流石に。","さすがに。"},
                {"ドエリング東邦","どえりんぐとうほう"},
                {"スマブラで相手を煽る","すまぶらであいてをあおる"},
                {"大東文化大学","だいとうぶんかだいがく"},
                {"富士急で絶叫","ふじきゅうでぜっきょう"},
                {"地上で溺れる","ちじょうでおぼれる"},
                {"見た目がおばさん","みためがおばさん"},
                {"ディーン","でぃーん"},
                {"大学で法律を学ぶ","だいがくでほうりつをまなぶ"},
                {"オーガさん","おーがさん"},
                {"それはバカ舌","それはばかじた"},
            //

            //井上編
                {"狂人、井上","きょうじん、いのうえ"},
                {"ハンドボールで相手にタックル","はんどぼーるであいてにたっくる"},
                {"毒霧を後輩に継承する","どくぎりをこうはいにけいしょうする"},
                {"友達のパンツを被る","ともだちのぱんつをかぶる"},
                {"伝説のソフトモヒカン","でんせつのそふともひかん"},
                {"夏合宿でお酒を飲もう","なつがっしゅくでおさけをのもう"},
                {"金貰ってんのに全然髪切らない泰誠","かねもらってんのにぜんぜんかみきらないたいせい"},
                {"サマーランドで毒霧","さまーらんどでどくぎり"},
                {"たいせい","たいせい"},
                {"先生の言い分に納得がいかない","せんせいのいいぶんになっとくがいかない"},
                {"メンソールがお気に入りです","めんそーるがおきにいりです"},
                {"ピカチュウソングをバスで熱唱","ぴかちゅうそんぐをばすでねっしょう"},
            //

            //横山編
                {"剛腕、横山","ごうわん、よこやま"},
                {"まさる","まさる"},
                {"金髪にした横山まさる","きんぱつにしたよこやままさる"},
                {"絶対にゴミ箱に捨てない","ぜったいにごみばこにすてない"},
                {"北海道の短大に進学","ほっかいどうのたんだいにしんがく"},
                {"ゆゆうたに激似","ゆゆうたにげきに"},
                {"雨が降ったので部活に行かない","あめがふったのでぶかつにいかない"},
                {"ネギトロを追いかけて電車に轢かれる","ねぎとろをおいかけてでんしゃにひかれる"},
                {"聞き間違いを揶揄い続ける","ききまちがいをからかいつづける"},
                {"仮入部中は仲良し","かりにゅうぶちゅうはなかよし"},
            //
            
            //菅野編
                {"大音声、菅野","だいおんじょう、すがの"},
                {"ホールドでルールガン無視","ほーるどでるーるがんむし"},
                {"ベンチプレスで吏発狂","べんちぷれすでつかさはっきょう"},
                {"吏がシンビンになる","つかさがしんびんになる"},
                {"挙句の果てには。","あげくのはてには。"},
                {"菅原ツカ様","すがわらつかさま"},
                {"シューズコレクター吏","しゅーずこれくたーつかさ"},
                {"靴紐を解いて時間を稼ぐ","くつひもをほどいてじかんをかせぐ"},
                {"すし処市柳","すしどころいちやなぎ"},
                {"日本工学院","にほんこうがくいん"},
                {"つかさ","つかさ"},
                {"専門学校で建築を学ぶ","せんもんがっこうでけんちくをまなぶ"},
                {"うざすぎマル","うざすぎまる"},
                {"棒倒しでひっくり返る","ぼうたおしでひっくりかえる"},
                {"人の運動靴を捨てる","ひとのうんどうぐつをすてる"},
            //

            //本田編
                {"カリスマ、本田","かりすま、ほんだ"},
                {"本田大空は声が低いが歌がうまい","ほんだそらはこえがひくいがうたがうまい"},
                {"大空の１０回クイズ","そらの１０かいくいず"},
                {"餃子が大好き","ぎょうざがだいすき"},
                {"埼玉医科大学","さいたまいかだいがく"},
                {"いろどり和菜三Ｏ三","いろどりわさいみわみ"},
                {"歯矯正ウーマン","はきょうせいうーまん"},
                {"あご","あご"},
                {"そら","そら"},
                {"先輩にあだ名をつける","せんぱいにあだなをつける"},
                {"テスト前は徹夜","てすとまえはてつや"},
            //

            //佐々木編
                {"煽り屋、佐々木","あおりや、ささき"},
                {"指を指して相手を煽る","ゆびをさしてあいてをあおる"},
                {"ハンドオフ！","はんどおふ！"},
                {"兄と一緒に家系が途絶えることを伝える","あにといっしょにかけいがとだえることをつたえる"},
                {"わたる","わたる"},
                {"病院に遅れる訳にはいかない","びょういんにおくれるわけにはいかない"},
            //

            //山下編
                {"遊び人、山下","あそびにん、やました"},
                {"やまげ","やまげ"},
                {"龍征決死のダンカンバカヤロー","りゅうせいけっしのだんかんばかやろー"},
                {"拓殖大学","たくしょくだいがく"},
                {"１番に入部届を出す","１ばんににゅうぶとどけをだす"},
                {"雷が大嫌い","かみなりがだいきらい"},
                {"舌磨きで嘔吐く","したみがきでえずく"},
            //      

            //二ノ宮編
                {"二枚目、二ノ宮","にまいめ、にのみや"},
                {"キョショックー","きょしょっくー"},
                {"ウェイトルームからシャトルを落とす","うぇいとるーむからしゃとるをおとす"},
                {"二ノ宮勇貴は太鼓の達人がうまい","にのみやゆうきはたいこのたつじんがうまい"},
                {"二ノ宮ファンクラブ","にのみやふぁんくらぶ"},
                {"東洋大学","とうようだいがく"},
                {"にの","にの"},
            //

            //牧野編
                {"反社、牧野","はんしゃ、まきの"},
                {"マッキー","まっきー"},
                {"大学でラクロスを始める","だいがくでらくろすをはじめる"},
                {"お姉さんはマネージャー","おねえさんはまねーじゃー"},
                {"圧倒的おけまる","あっとうてきおけまる"},
            //

            //木下編
                {"内弁慶、木下","うちべんけい、きのした"},
                {"きのし","きのし"},
                {"初夏のおちんちん川柳","しょかのおちんちんせんりゅう"},
                {"独身物件、化け物ハウス","どくしんぶっけん、ばけものはうす"},
                {"鶴ヶ島教習所の神童,キノシタ","つるがしまきょうしゅうじょのしんどう、きのした"},
                {"つけ麺の量に絶望","つけめんのりょうにぜつぼう"},
                {"いい意味で","いいいみで"},
                {"チキチキバンバン","ちきちきばんばん"},
                {"くら寿司でアルバイト","くらずしであるばいと"},
                {"おい堀江、可愛がってやるよ","おいほりえ、かわいがってやるよ"},
                {"言わせとけ。","いわせとけ。"},
                {"ワセリンが隠し味","わせりんがかくしあじ"},
                {"関西弁を真似る","かんさいべんをまねる"},
                {"きのしの誇張モノマネ","きのしのこちょうものまね"},
                {"緊張して浴びるように酒を飲む","きんちょうしてあびるようにさけをのむ"},
                {"パンツもスパッツも取り上げる","ぱんつもすぱっつもとりあげる"},
            //

            //大塚いっせい編
                {"一匹狼、大塚","いっぴきおおかみ、おおつか"},
                {"アーッセ","あーっせ"},
                {"いっせい","いっせい"},
                {"部活をやめる","ぶかつをやめる"},
                {"デカイ木の枝を拾う","でかいきのえだをひろう"},
            //

            //安達編
                {"日本とイスラエルのハーフ","にほんといすらえるのはーふ"},
                {"エリチ","えりち"},
                {"大学で観光を学ぶ","だいがくでかんこうをまなぶ"},
                {"左ハンドルのマニュアル車を運転する","ひだりはんどるのまにゅあるしゃをうんてんする"},
                {"大学で留学","だいがくでりゅうがく"},
            //

            //中妻編
                {"クルーザー持ってます","くるーざーもってます"},
                {"あかりん","あかりん"},
                {"短大で保育を学ぶ","たんだいでほいくをまなぶ"},
                {"そういうとこだよ","そういうとこだよ"},
                {"友達を紹介する","ともだちをしょうかいする"},
            //
        //

        //その他
            {"わたるとぐっさんは嬉々として火に油を注ぐ","わたるとぐっさんはききとしてひにあぶらをそそぐ"},
            {"大学デビューでたばこデビュー","だいがくでびゅーでたばこでびゅー"},        
            {"モンキーターンで目が回る","もんきーたーんでめがまわる"},    
            {"筋トレ後はサラダチキン","きんとれあとはさらだちきん"},
            {"あいな大好きチームとしおり大好きチーム","あいなだいすきちーむとしおりだいすきちーむ"},
            {"さっちゃんはね、ごっつっていうんだホントはね","さっちゃんはね、ごっつっていうんだほんとはね"},
            {"ハーフタイムで交代","はーふたいむでこうたい"},
            {"友達の親を呼び捨てする","ともだちのおやをよびすてする"},
            {"マルチ商法にハマったまさとさん","まるちしょうほうにはまったまさとさん"},
            {"二ノ宮、勝負！","にのみや、しょうぶ！"},
            {"丸山先生声でかすぎ問題","まるやませんせいこえでかすぎもんだい"},
            {"久々の跳び箱で大事故","ひさびさのとびばこでだいじこ"},
            {"埼玉県代表に上り詰めた黒木","さいたまけんだいひょうにのぼりつめたくろき"},
            {"おさみでゴザル","おさみでござる"},
            {"フィジカルおばけ、永野","ふぃじかるおばけ、ながの"},
            {"二十歳になったら年金を払おう","はたちになったらねんきんをはらおう"},
            {"俊足のちんさん","しゅんそくのちんさん"},
            {"指定校推薦","していこうすいせん"},
            {"彼の名前は中エイズ","かれのなまえはなかえいず"},
            {"東武東上線は今日も遅延中","とうぶとうじょうせんはきょうもちえんちゅう"},
            {"しょうまとこうまの区別がつかない","しょうまとこうまのくべつがつかない"},
            {"頑張ることと無理をすることは違う","がんばることとむりをすることはちがう"},
            {"筋トレでストレス発散","きんとれですとれすはっさん"},
            {"ウェイトルームを掃除する","うぇいとるーむをそうじする"},
            {"タックルパックでお昼寝","たっくるぱっくでおひるね"},
            {"退部者に厳しすぎる","たいぶしゃにきびしすぎる"},
            {"メロンソーダ味のポテトチップス","めろんそーだあじのぽてとちっぷす"},
            {"ラックで相手を殴る","らっくであいてをなぐる"},
            {"文房具が大好き","ぶんぼうぐがだいすき"},
            {"アマングアス？アモングアス？","あまんぐあす？あもんぐあす？"},
            {"面倒ごとの押し付け合戦","めんどうごとのおしつけがっせん"},
            {"天パはみんな足が速い","てんぱはみんなあしがはやい"},
            {"そうだ、秩父に行こう","そうだ、ちちぶにいこう"},
            {"バスケ部が２階を散らかす","ばすけぶが２かいをちらかす"},
            {"ふーまはみんなと仲良し","ふーまはみんなとなかよし"},
            {"食堂のおばさんの名前は伊藤さん","しょくどうのおばさんのなまえはいとうさん"},
            {"ＰＵＢＧと書いてパブジーと読む","ＰＵＢＧとかいてぱぶじーとよむ"},
            {"今はもう無きパパゲーノ","いまはもうなきぱぱげーの"},
            {"ポロシャツで登校","ぽろしゃつでとうこう"},
            {"太陽に激似の女の子","たいようにげきにのおんなのこ"},
            {"ヘビースモーカー柳下","へびーすもーかーやぎした"},
            {"バスで爆睡","ばすでばくすい"},
            {"志木の千里眼","しきのせんりがん"},
            {"菅野秀治","すがのしゅうじ"},
            {"ホテルカナダ","ほてるかなだ"},
            {"助監督きどけん","じょかんとくきどけん"},
            {"東所沢の民は曲者揃い","ひがしところざわのたみはくせものぞろい"},
            {"つけ麺屋福寅","つけめんやふくとら"},
            {"竹屋","たけや"},
            {"鬼ごっこで先輩を盾にする","おにごっこでせんぱいをたてにする"},   
            {"意外と大事な首の筋肉","いがいとだいじなくびのきんにく"},
            {"ウェイトをサボる","うぇいとをさぼる"},
            {"ジョーさんはお風呂で放尿","じょーさんはおふろでほうにょう"},
            {"重りを乗せた台車で壁を破壊","おもりをのせただいしゃでかべをはかい"},
            {"後輩に悪影響を与える","こうはいにあくえいきょうをあたえる"},
            {"球の感覚と書いて球覚","たまのかんかくとかいてきゅうかく"},
            {"ラグビーもサッカーも元はおんなじ","らぐびーもさっかーももとはおんなじ"},
            {"食べ残しは御法度","たべのこしはごはっと"},
            {"いつかみんなで飲みに行こう","いつかみんなでのみにいこう"},
            {"３年間ありがとう","３ねんかんありがとう"}
        //     
        
    };

    //変換リスト(HashMap)(キー：日本語全角　値：英語全角)
    public Dictionary<string, string[]> Henkan = new Dictionary<string, string[]>{
        //メモ：macだと全角英数字を打つには「ひらがなで打つ」→「Control + l」の手順が必要
        //普通のかな
            {"あ",new string[1] {"Ａ"} },
            {"い",new string[2] {"Ｉ", "ＹＩ"} },
            {"う",new string[3] {"Ｕ", "ＷＵ", "ＷＨＵ"} },
            {"え",new string[1] {"Ｅ"} },
            {"お",new string[1] {"Ｏ"} },

            {"か",new string[2] {"ＫＡ", "ＣＡ"} },
            {"き",new string[1] {"ＫＩ"} },
            {"く",new string[2] {"ＫＵ", "ＣＵ"} },
            {"け",new string[1] {"ＫＥ"} },
            {"こ",new string[2] {"ＫＯ", "ＣＯ"} },

            {"さ",new string[1] {"ＳＡ"} },
            {"し",new string[3] {"ＳＩ", "ＳＨＩ", "ＣＩ"} },
            {"す",new string[1] {"ＳＵ"} },
            {"せ",new string[2] {"ＳＥ", "ＣＥ"} },
            {"そ",new string[1] {"ＳＯ"} },

            {"た",new string[1] {"ＴＡ"} },
            {"ち",new string[2] {"ＴＩ", "ＣＨＩ"} },
            {"つ",new string[2] {"ＴＵ", "ＴＳＵ"} },
            {"て",new string[1] {"ＴＥ"} },
            {"と",new string[1] {"ＴＯ"} },

            {"な",new string[1] {"ＮＡ"} },
            {"に",new string[1] {"ＮＩ"} },
            {"ぬ",new string[1] {"ＮＵ"} },
            {"ね",new string[1] {"ＮＥ"} },
            {"の",new string[1] {"ＮＯ"} },

            {"は",new string[1] {"ＨＡ"} },
            {"ひ",new string[1] {"ＨＩ"} },
            {"ふ",new string[2] {"ＦＵ", "ＨＵ"} },
            {"へ",new string[1] {"ＨＥ"} },
            {"ほ",new string[1] {"ＨＯ"} },

            {"ま",new string[1] {"ＭＡ"} },
            {"み",new string[1] {"ＭＩ"} },
            {"む",new string[1] {"ＭＵ"} },
            {"め",new string[1] {"ＭＥ"} },
            {"も",new string[1] {"ＭＯ"} },

            {"や",new string[1] {"ＹＡ"} },
            {"ゐ",new string[1] {"ＷＹＩ"} },
            {"ゆ",new string[1] {"ＹＵ"} },
            {"ゑ",new string[1] {"ＷＹＥ"} },
            {"よ",new string[1] {"ＹＯ"} },

            {"ら",new string[1] {"ＲＡ"} },
            {"り",new string[1] {"ＲＩ"} },
            {"る",new string[1] {"ＲＵ"} },
            {"れ",new string[1] {"ＲＥ"} },
            {"ろ",new string[1] {"ＲＯ"} },

            {"わ",new string[1] {"ＷＡ"} },
            {"を",new string[1] {"ＷＯ"} },
            {"ん",new string[3] {"Ｎ", "ＮＮ", "ＸＮ"} },
        //

        //濁点
            {"ゔ",new string[1] {"ＶＵ"} },
            {"が",new string[1] {"ＧＡ"} },
            {"ぎ",new string[1] {"ＧＩ"} },
            {"ぐ",new string[1] {"ＧＵ"} },
            {"げ",new string[1] {"ＧＥ"} },
            {"ご",new string[1] {"ＧＯ"} },

            {"ざ",new string[1] {"ＺＡ"} },
            {"じ",new string[2] {"ＪＩ", "ＺＩ"} },
            {"ず",new string[1] {"ＺＵ"} },
            {"ぜ",new string[1] {"ＺＥ"} },
            {"ぞ",new string[1] {"ＺＯ"} },

            {"だ",new string[1] {"ＤＡ"} },
            {"ぢ",new string[1] {"ＤＩ"} },
            {"づ",new string[1] {"ＤＵ"} },
            {"で",new string[1] {"ＤＥ"} },
            {"ど",new string[1] {"ＤＯ"} },

            {"ば",new string[1] {"ＢＡ"} },
            {"び",new string[1] {"ＢＩ"} },
            {"ぶ",new string[1] {"ＢＵ"} },
            {"べ",new string[1] {"ＢＥ"} },
            {"ぼ",new string[1] {"ＢＯ"} },

            {"ぱ",new string[1] {"ＰＡ"} },
            {"ぴ",new string[1] {"ＰＩ"} },
            {"ぷ",new string[1] {"ＰＵ"} },
            {"ぺ",new string[1] {"ＰＥ"} },
            {"ぽ",new string[1] {"ＰＯ"} },
        //

        //小文字
            {"ぁ",new string[2] {"ＬＡ", "ＸＡ"} },
            {"ぃ",new string[4] {"ＬＩ", "ＸＩ","ＬＹＩ", "ＸＹＩ"} },
            {"ぅ",new string[2] {"ＬＵ", "ＸＵ"} },
            {"ぇ",new string[2] {"ＬＥ", "ＸＥ"} },
            {"ぉ",new string[2] {"ＬＯ", "ＸＯ"} },

            {"ゃ",new string[2] {"ＬＹＡ", "ＸＹＡ"} },
            {"ゅ",new string[2] {"ＬＹＵ", "ＸＹＵ"} },
            {"ょ",new string[2] {"ＬＹＯ", "ＸＹＯ"} },

            {"っ",new string[4] {"ＬＴＵ", "ＸＴＵ", "ＬＴＳＵ", "ＸＴＳＵ"} },
        //

        //拗音
            {"いぇ",new string[1] {"ＹＩ"} },

            {"うぁ",new string[1] {"ＷＨＡ"} },
            {"うぃ",new string[2] {"ＷＩ", "ＷＨＩ"} },
            {"うぇ",new string[2] {"ＷＥ", "ＷＨＥ"} },
            {"うぉ",new string[1] {"ＷＨＯ"} },

            {"ゔぁ",new string[1] {"ＶＡ"} },
            {"ゔぃ",new string[2] {"ＶＩ" ,"ＶＹＩ"} },
            {"ゔぇ",new string[2] {"ＶＥ", "ＶＹＥ"} },
            {"ゔぉ",new string[1] {"ＶＯ"} },

            {"ゔゃ",new string[1] {"ＶＹＡ"} },
            {"ゔゅ",new string[1] {"ＶＹＵ"} },
            {"ゔょ",new string[1] {"ＶＹＯ"} },

            {"きゃ",new string[1] {"ＫＹＡ"} },
            {"きぃ",new string[1] {"ＫＹＩ"} },
            {"きゅ",new string[1] {"ＫＹＵ"} },
            {"きぇ",new string[1] {"ＫＹＥ"} },
            {"きょ",new string[1] {"ＫＹＯ"} },

            {"ぎゃ",new string[1] {"ＧＹＡ"} },
            {"ぎぃ",new string[1] {"ＧＹＩ"} },
            {"ぎゅ",new string[1] {"ＧＹＵ"} },
            {"ぎぇ",new string[1] {"ＧＹＥ"} },
            {"ぎょ",new string[1] {"ＧＹＯ"} },

            {"しゃ",new string[2] {"ＳＹＡ", "ＳＨＡ"} },
            {"しぃ",new string[1] {"ＳＹＩ"} },
            {"しゅ",new string[2] {"ＳＹＵ", "ＳＨＵ"} },
            {"しぇ",new string[2] {"ＳＹＥ", "ＳＨＥ"} },
            {"しょ",new string[2] {"ＳＹＯ", "ＳＨＯ"} },            

            {"じゃ",new string[3] {"ＪＡ", "ＪＹＡ", "ＺＹＡ"} },
            {"じぃ",new string[2] {"ＪＹＩ", "ＺＨＩ"} },
            {"じゅ",new string[3] {"ＪＵ", "ＪＹＵ", "ＺＹＵ"} },
            {"じぇ",new string[3] {"ＪＥ", "ＪＹＥ", "ＺＹＥ"} },
            {"じょ",new string[3] {"ＪＯ", "ＪＹＯ", "ＺＹＯ"} },

            {"ちゃ",new string[3] {"ＴＹＡ", "ＣＨＡ", "ＣＹＡ"} },
            {"ちぃ",new string[2] {"ＴＹＩ", "ＣＹＩ"} },
            {"ちゅ",new string[3] {"ＴＹＵ", "ＣＨＵ", "ＣＹＵ"} },
            {"ちぇ",new string[3] {"ＴＹＥ", "ＣＨＥ", "ＣＹＥ"} },
            {"ちょ",new string[3] {"ＴＹＯ", "ＣＨＯ", "ＣＹＯ"} },

            {"ぢゃ",new string[1] {"ＤＹＡ"} },
            {"ぢぃ",new string[1] {"ＤＹＩ"} },
            {"ぢゅ",new string[1] {"ＤＹＵ"} },
            {"ぢぇ",new string[1] {"ＤＹＥ"} },
            {"ぢょ",new string[1] {"ＤＹＯ"} },

            {"てゃ",new string[1] {"ＴＨＡ"} },
            {"てぃ",new string[1] {"ＴＨＩ"} },
            {"てゅ",new string[1] {"ＴＨＵ"} },
            {"てぇ",new string[1] {"ＴＨＥ"} },
            {"てょ",new string[1] {"ＴＨＯ"} },
            
            {"でゃ",new string[1] {"ＤＨＡ"} },
            {"でぃ",new string[1] {"ＤＨＩ"} },
            {"でゅ",new string[1] {"ＤＨＵ"} },
            {"でぇ",new string[1] {"ＤＨＥ"} },
            {"でょ",new string[1] {"ＤＨＯ"} },     

            {"にゃ",new string[1] {"ＮＹＡ"} },
            {"にぃ",new string[1] {"ＮＹＩ"} },
            {"にゅ",new string[1] {"ＮＹＵ"} },
            {"にぇ",new string[1] {"ＮＹＥ"} },
            {"にょ",new string[1] {"ＮＹＯ"} },     

            {"ひゃ",new string[1] {"ＨＹＡ"} },
            {"ひぃ",new string[1] {"ＨＹＩ"} },
            {"ひゅ",new string[1] {"ＨＹＵ"} },
            {"ひぇ",new string[1] {"ＨＹＥ"} },
            {"ひょ",new string[1] {"ＨＹＯ"} },  

            {"びゃ",new string[1] {"ＢＹＡ"} },
            {"びぃ",new string[1] {"ＢＹＩ"} },
            {"びゅ",new string[1] {"ＢＹＵ"} },
            {"びぇ",new string[1] {"ＢＹＥ"} },
            {"びょ",new string[1] {"ＢＹＯ"} },

            {"ぴゃ",new string[1] {"ＰＹＡ"} },
            {"ぴぃ",new string[1] {"ＰＹＩ"} },
            {"ぴゅ",new string[1] {"ＰＹＵ"} },
            {"ぴぇ",new string[1] {"ＰＹＥ"} },
            {"ぴょ",new string[1] {"ＰＹＯ"} },

            {"ふぁ",new string[1] {"ＦＡ"} },
            {"ふぃ",new string[2] {"ＦＩ", "ＦＹＩ"} },
            {"ふぇ",new string[2] {"ＦＥ", "ＦＹＥ"} },
            {"ふぉ",new string[1] {"ＦＯ"} },

            {"ふゃ",new string[1] {"ＦＹＡ"} },
            {"ふゅ",new string[1] {"ＦＹＵ"} },
            {"ふょ",new string[1] {"ＦＹＯ"} },

            {"みゃ",new string[1] {"ＭＹＡ"} },
            {"みぃ",new string[1] {"ＭＹＩ"} },
            {"みゅ",new string[1] {"ＭＹＵ"} },
            {"みぇ",new string[1] {"ＭＹＥ"} },
            {"みょ",new string[1] {"ＭＹＯ"} },

            {"りゃ",new string[1] {"ＲＹＡ"} },
            {"りぃ",new string[1] {"ＲＹＩ"} },
            {"りゅ",new string[1] {"ＲＹＵ"} },
            {"りぇ",new string[1] {"ＲＹＥ"} },
            {"りょ",new string[1] {"ＲＹＯ"} },
        //

        //記号など
            {"、",new string[1] {"，"} },
            {"，",new string[1] {"，"} },
            {"。",new string[1] {"．"} },
            {"．",new string[1] {"．"} },
            {"ー",new string[1] {"－"} },
            {"！",new string[1] {"！"} },
            {"？",new string[1] {"？"} },
            {"（",new string[1] {"（"}},
            {"）",new string[1] {"）"}},
            {"＾",new string[1] {"＾"}},

            {"１",new string[1] {"１"} },
            {"２",new string[1] {"２"} },
            {"３",new string[1] {"３"} },
            {"４",new string[1] {"４"} },
            {"５",new string[1] {"５"} },
            {"６",new string[1] {"６"} },
            {"７",new string[1] {"７"} },
            {"８",new string[1] {"８"} },
            {"９",new string[1] {"９"} },
            {"０",new string[1] {"０"} },

            {"Ａ",new string[1] {"Ａ"} },
            {"Ｂ",new string[1] {"Ｂ"} },
            {"Ｃ",new string[1] {"Ｃ"} },
            {"Ｄ",new string[1] {"Ｄ"} },
            {"Ｅ",new string[1] {"Ｅ"} },
            {"Ｆ",new string[1] {"Ｆ"} },
            {"Ｇ",new string[1] {"Ｇ"} },
            {"Ｈ",new string[1] {"Ｈ"} },
            {"Ｉ",new string[1] {"Ｉ"} },
            {"Ｊ",new string[1] {"Ｊ"} },
            {"Ｋ",new string[1] {"Ｋ"} },
            {"Ｌ",new string[1] {"Ｌ"} },
            {"Ｍ",new string[1] {"Ｍ"} },
            {"Ｎ",new string[1] {"Ｎ"} },
            {"Ｏ",new string[1] {"Ｏ"} },
            {"Ｐ",new string[1] {"Ｐ"} },
            {"Ｑ",new string[1] {"Ｑ"} },
            {"Ｒ",new string[1] {"Ｒ"} },
            {"Ｓ",new string[1] {"Ｓ"} },
            {"Ｔ",new string[1] {"Ｔ"} },
            {"Ｕ",new string[1] {"Ｕ"} },
            {"Ｖ",new string[1] {"Ｖ"} },
            {"Ｗ",new string[1] {"Ｗ"} },
            {"Ｘ",new string[1] {"Ｘ"} },
            {"Ｙ",new string[1] {"Ｙ"} },
            {"Ｚ",new string[1] {"Ｚ"} }

        //
    };

    const int SIZE = 30;
    //書き得るローマ文字列リスト(高々２０もないくらいだと思う。)
    public string[] TrueRomaList = new string [SIZE];

    //ふりがな表示
    public GameObject Furi;
    Text furiText;
    //日本語表示
    public GameObject Jap;
    Text japText;
    //ローマ字表示
    public GameObject Roma;
    Text romaText;
    //既に入力したローマ字
    public GameObject Roma_Color;
    Text romaColorText;

    

    GameObject TypeManager;//

    //他のクラスを取得するための変数
    TypingScript TypingScript;//
    GameSystem SystemScript;//

    
    public int textNum; //配列の何番目の文字列か
    public int textSum; //
    public int KanaCharNum; //文字列(ひらがな)の何文字目か
    public int KanaMojiSum;//ひらがなを合計何文字打ったか
    public int RomaCharNum;//文字列(ローマ字)の何文字目か
    public string trueTextString;  //打つべき正しい文字列
    string NotTypedRoma;//まだ打ってないローマ字
    int NotTypedRomaLength;//まだ打ってないローマ字の長さ
    string TypedRoma;//今まで打ったテキスト全体の文字列
    int TypedRomaLength;//打ったローマ字の長さ
    bool skipChar;//trueなら打ち終わったときに2文字飛ばす。
    int ListSize;//打てる数だけ記録する。()
    bool plussN;//「ん」をNNとも打てる時の判定
    public string tmp;//TypingScriptにあったけどこっちにお引越し(比較用)
    public string typestring;//TypingScriptにあったけどこっちにお引越し(更新用)
    public int flag;//打った文字があってるかどうかの判定。-1:違う 0:何もなし 1:合ってる
    public float LimitMax;//タイムリミットの最大値(動的に変化する。)
    public bool TextFlag;//1文打ち終わった判定


    //一応ここで順番をランダムにした後にManagerの処理を進めたいから
    //ランダムにしたら値をtrueにする。
    //public bool flag　= false;

    void Awake()
    {
        //最初に中身をランダムに入れ替える
        Shuffle();

        //ここでタイムリミットも決めちゃう(文字の長さの半分が標準)
        LimitMax = dic[textNum,1].Length * 0.5f + 1;
    }

    // Start is called before the first frame update
    void Start()
    {
        //ゲームオブジェクトを名前で取得
        TypeManager = GameObject.Find("TypingManager");
        //ゲームオブジェクトDictionaryのスクリプトを取得する
        TypingScript = TypeManager.GetComponent<TypingScript>();
        japText = Jap.GetComponent<Text>();
        romaText = Roma.GetComponent<Text>();
        furiText = Furi.GetComponent<Text>();
        //romaColorText = Roma_Color.GetComponent<Text>();
        //romaText = Roma.GetComponent<Text>();
        romaColorText = Roma_Color.GetComponent<Text>();
        SystemScript = GameObject.Find("GameManager").GetComponent<GameSystem>();
        /*japText = null;
        romaText = null;
        romaColorText = null;*/

        textNum = 0;//順番の初期化(最初だから０)
        textSum = 0;//打った文字列の数を初期化
        RomaCharNum = 0;//打った文字数の初期化
        
        furiText.text = "ここにはふりがなが表示されます。";
        japText.text = "ここには日本語が表示されます。";
        romaText.text = "ここにはローマ字が表示されます。";
        romaColorText.text = "";
        
        KanaCharNum = 0;
        KanaMojiSum = 0;

        skipChar = false;
        TrueRomaList = MakeTypingRoma(TrueRomaList, KanaCharNum, textNum, "");
        trueTextString = TrueRomaList[0];

        tmp = "";
        typestring = "";
        plussN = false;
        flag = 0;

        TextFlag = false;

        Debug.Log("Dictionary Length:" + dic.GetLength(0));

        //LimitMax = dic[textNum,1].Length * 0.5f;
    }

    // Update is called once per frame
    void Update()
    {
        
        //if(SystemScript.Mode == 2 || SystemScript.Mode == 4){
            if( TextFlag && SystemScript.UpdatedLimitFlag){
                TextFlag = false;
            }       
        //}
        
        //(start == 1)の時はゲームが始まってる状態
        if(SystemScript.start == 1){

            //合ってるかどうかの判定を初期化
            flag = 0;
            
            //dic[]のテキストを全部打ったら
            if(textNum + 1 == dic.GetLength(0)){
                //Debug.Log("はい。おわりました。");
                Shuffle();  //シャッフルし直す
                textNum = 0;//最初の番号に戻る
                typestring = ""; 
                ResetArray(TrueRomaList);
                TrueRomaList = MakeTypingRoma(TrueRomaList, KanaCharNum, textNum, "");
                TypedRoma = "";//今まで打った文字も初期化
                TypedRomaLength = 0;
                trueTextString = TrueRomaList[0];
            }

            tmp = typestring;

            //文字列の長さ分正しくタイプしたら（１テキスト分タイプ完了）
            if(KanaCharNum == dic[textNum,1].Length){
                textSum++;  //打った文字列の数を増やす
                KanaCharNum = 0; //文字数をリセット
                textNum++ ;//テキストを変えるので１増やして次のテキストに移る
                RomaCharNum = 0;
                typestring = "";//TypingScriptのtypestringを初期化する
                
                ResetArray(TrueRomaList);
                TrueRomaList = MakeTypingRoma(TrueRomaList, KanaCharNum, textNum, "");
                TypedRoma = "";//今まで打った文字も初期化
                TypedRomaLength = 0;
                trueTextString = TrueRomaList[0];//CreateDefaultRoma(textNum,0);//dic[textNum,1];//最初は用意してある文字列にする
                TextFlag = true;
                LimitMax = dic[textNum,1].Length * 0.5f + 1;
            }

            //ローマ字文字列の種類をここで調べる。変更もする。
            if(TypingScript.type){ //何かキーが打たれれば
                tmp += TypingScript.typeChar;
                for(int i = 0; i < SIZE; i++){//配列の要素分調べる
                    //「ＮＮ」って表せる時の判定
                    if(plussN && TypingScript.typeChar.Equals("Ｎ") && typestring.Length == 0){
                        TypedRoma += "Ｎ";
                        plussN = false;
                        tmp = "";
                        flag = 1;
                        break;
                    }
                    //もしどれかの文字列とTypingScriptで打った文字列が一致してれば
                    else if(string.IsNullOrEmpty(TrueRomaList[i])){}
                    else if(TrueRomaList[i].Length < tmp.Length){}
                    else if(TrueRomaList[i].Substring(0,tmp.Length).Equals(tmp)){
                        //Debug.Log(i + ": " + TrueRomaList[i]);

                        trueTextString = TrueRomaList[i];//その文字列を正解の文字列とする
                        flag = 1;//見つかった印をつける
                        typestring = tmp;
                        TypedRoma += TypingScript.typeChar;
                        RomaCharNum++;
                        KanaMojiSum++;
                        //Debug.Log(KanaMojiSum);
                        //一文字分打ったらひらがなの文字数を増やす
                        if(typestring.Length == trueTextString.Length){
                            if(typestring.Equals("Ｎ") && trueTextString.Length == 1 && dic[textNum,1].Substring(KanaCharNum,1).Equals("ん"))plussN = true;
                            else plussN = false;
                            if( IsYouon(tmp)| skipChar )KanaCharNum++;
                            KanaCharNum++;
                            //if((dic[textNum,1].Substring(KanaCharNum - 1,1)).Equals("っ"))Debug.Log("「っ」がきた");
                            typestring = "";
                            ResetArray(TrueRomaList);
                            if(KanaCharNum < dic[textNum, 1].Length)TrueRomaList = MakeTypingRoma(TrueRomaList,KanaCharNum,textNum,TypingScript.typeChar);
                            tmp = "";

                            for(int j = 0;j < SIZE; j++){
                                if(!string.IsNullOrEmpty(TrueRomaList[j])){
                                    trueTextString = TrueRomaList[j];   
                                    break;
                                }                             
                            }

                        }
                        //Debug.Log("ここはできてるんだけどね");
                     
                        break;
                    }
                    else flag = -1;
                    //Debug.Log(TrueRomaList[i]);//
                }
                //何も一致しなかったら何もしない。
                
            }


            //ふりがなの表示
            furiText.text = dic[textNum,1];
            //上の日本語の表示
            japText.text = dic[textNum,0];

            //もしもすべての文を書き終わったら順番をシャッフルして繰り返す
            //長さの調整
            if(string.IsNullOrEmpty(TypedRoma))TypedRomaLength = 0;
            else TypedRomaLength = TypedRoma.Length;
            if(string.IsNullOrEmpty(NotTypedRoma))NotTypedRomaLength = 0;
            else NotTypedRomaLength = NotTypedRoma.Length;

            if(skipChar)NotTypedRoma = trueTextString.Substring(typestring.Length) +  CreateDefaultRoma(textNum,KanaCharNum + 2);
            else NotTypedRoma = trueTextString.Substring(typestring.Length) + CreateDefaultRoma(textNum,KanaCharNum + 1);

            //ローマ字(未打)の表示
            romaText.text = ChangeColor(NotTypedRoma, TypedRomaLength, 0);

            //ローマ字(既打)の表示
            romaColorText.text = ChangeColor(TypedRoma,NotTypedRomaLength, 1);

        }
    }

    //文字列の色を変えるメソッド(主な文字列,スペースの数、テキストの種類)
    //閃いた、完全に閃いた。色付きの文字列と黒いテキストに分ける。
    //打った文字の分に沿ってスペースを入れて位置を調整する
    string ChangeColor(string Text,int SpaceNum,int flag)
    {
        //Debug.Log("ChangeColor!!");
        char space = '　';//調整用の全角スペース
        string text = "";//表示する文字列

        //0なら既に打った色付き文字を先に代入する
        if(flag == 1)text = Text;
        //textに残りの文字数分spaceを加えて調整する
        for(int i = 0; i < SpaceNum; i++)text += space;
        //0ならまだ打ってない色なし文字を加える。
        if(flag == 0)text += Text;

        return text;
    }

    // 引数として受け取った配列の要素番号を並び替えるメソッド
    void Shuffle()
    {
        for(int i = 0; i < dic.GetLength(0); i++){
            //（説明１）現在の要素を預けておく
            string temp0 = dic[i,0]; 
            string temp1 = dic[i,1];
            //（説明２）入れ替える先をランダムに選ぶ
            int randomIndex = Random.Range(0, dic.GetLength(0)); 
            //（説明３）現在の要素に上書き
            dic[i,0] = dic[randomIndex,0]; 
            dic[i,1] = dic[randomIndex,1];
            //（説明４）入れ替え元に預けておいた要素を与える
            dic[randomIndex,0] = temp0; 
            dic[randomIndex,1] = temp1;
        }
    }

    //まだ打ってないローマ字(デフォルト)を作るメソッド(テキスト番号、何文字目からか)
    string CreateDefaultRoma(int Text,int Char)
    {
        //Debug.Log("Char : " + Char);
        string str = "";
        string futamoji = "";
        string nextmoji = "";
        string nowmoji = "";
        bool tu = false;//一文字目が「っ」ならtrue
        bool kigou = false;//次の文字が記号系ならtrue
        bool NN = false;//次の文字が母音、記号、ナ行、ん、ならtrue。ＮＮって打たないといけない判定。
        bool boin = false;//次の文字が母音ならtrue;
        bool last = false;//ラストの文字かどうか
        
        for(int i = 0; Char + i < dic[Text,1].Length; i++){
            //毎回ループの最初に初期化
            tu = false;
            boin = false;
            kigou = false;
            NN = false;

            nowmoji = dic[Text,1].Substring(Char + i,1);            
            //次に文字が存在したら実行する
            if(Char + i + 1 < dic[Text,1].Length){
                futamoji = dic[Text,1].Substring(Char + i,2);
                nextmoji = dic[Text,1].Substring(Char + i + 1,1);
                
                if(nowmoji.Equals("っ"))tu = true;
                if( nextmoji.Equals("あ") | nextmoji.Equals("え") | nextmoji.Equals("お") )boin = true;
                if( nextmoji.Equals("１") | nextmoji.Equals("２") | nextmoji.Equals("３") | nextmoji.Equals("４") | nextmoji.Equals("５")
                 | nextmoji.Equals("６") | nextmoji.Equals("７") | nextmoji.Equals("８") | nextmoji.Equals("９") | nextmoji.Equals("０")
                 | nextmoji.Equals("Ａ") | nextmoji.Equals("Ｂ") | nextmoji.Equals("Ｃ") | nextmoji.Equals("Ｄ") | nextmoji.Equals("Ｅ")
                 | nextmoji.Equals("Ｆ") | nextmoji.Equals("Ｇ") | nextmoji.Equals("Ｈ") | nextmoji.Equals("Ｉ") | nextmoji.Equals("Ｊ")
                 | nextmoji.Equals("Ｋ") | nextmoji.Equals("Ｌ") | nextmoji.Equals("Ｍ") | nextmoji.Equals("Ｎ") | nextmoji.Equals("Ｏ")
                 | nextmoji.Equals("Ｐ") | nextmoji.Equals("Ｑ") | nextmoji.Equals("Ｒ") | nextmoji.Equals("Ｓ") | nextmoji.Equals("Ｔ")
                 | nextmoji.Equals("Ｕ") | nextmoji.Equals("Ｖ") | nextmoji.Equals("Ｗ") | nextmoji.Equals("Ｘ") | nextmoji.Equals("Ｙ")
                 | nextmoji.Equals("Ｚ")
                 )kigou = true;    
                if( nextmoji.Equals("，") | nextmoji.Equals("．") | nextmoji.Equals("－") | nextmoji.Equals("！") | nextmoji.Equals("？")  
                 | nextmoji.Equals("な") | nextmoji.Equals("に") | nextmoji.Equals("ぬ") | nextmoji.Equals("ね") | nextmoji.Equals("の") | nextmoji.Equals("ん") 
                 | boin )NN = true;
            }
            else{
                futamoji = "";
                nextmoji = "";
                last  = true;
                NN = true;
            }
            //日本語のテキストの文字をキーにHenkanの値の配列の0番目を持ってくる
            //二文字分を表せる場合
            //Debug.Log(nextmoji);
            if(Henkan.ContainsKey(futamoji) && !last){
                str += Henkan[futamoji][0];
                i++;
            }
            
            //「っ」の後に「い」と「う」が来た時の判定
            else if(Char + i > 0 && dic[Text,1].Substring(Char + i - 1,1).Equals("っ") && (nowmoji.Equals("う") || nowmoji.Equals("い")))str += Henkan[nowmoji][1];
            //最後の文字じゃないかつ今見てる文字が「っ」で頭文字を二回打って表現できる時
            else if( tu && !NN && !last && !kigou){
                if(Henkan[nextmoji][0].Equals("Ｉ") || Henkan[nextmoji][0].Equals("Ｕ"))str += Henkan[nextmoji][1].Substring(0,1);
                //Debug.Log(i + " (nextmoji)" + Henkan[nextmoji][0].Substring(0,1));
                else str += Henkan[nextmoji][0].Substring(0,1);
            }
            else if(nowmoji.Equals("ん") && (NN || nextmoji.Equals("う") || nextmoji.Equals("い") || Henkan[nextmoji][0].Substring(0,1).Equals("Ｙ"))) str += "ＮＮ";
            else {  
                str += Henkan[nowmoji][0];
                //Debug.Log(i + " (nowmoji)" + Henkan[nowmoji][0]);
            }
        }
            
        
        return str;
    }

    //今打つべきローマ字の文字列を作るメソッド(返す配列、何文字目か(ひらがな)、テキストの番号,一文字前の文字)
    string[] MakeTypingRoma(string[] str, int CharNum, int text, string backstr)
    {
        string hitomoji = dic[text,1].Substring(CharNum,1);//一文字目の文字
        string futamoji = "";//二文字分の文字(ひらがな)
        string nextChar = "";//二文字目の文字(ひらがな)
        int kanryakuLength = 0;//二文字分読んだ場合の楽に書け得るパターンの数
        int count  = 0;
        bool tu = false;//前の文字が「っ」ならtrue
        bool kigou = false;//次の文字が記号系ならtrue
        bool NN = false;//次の文字が母音、記号、ナ行、ん、ならtrue。ＮＮって打たないといけない判定。
        bool boin = false;//次の文字が母音ならtrue;
        int Counter = 0;//配列に順番に値を入れていくために使うカウンター

        //Debug.Log("backstr = " + backstr);

        if(CharNum > 0 && dic[text,1].Substring(CharNum - 1,1).Equals("っ"))tu = true;

        //最後の文字じゃなかったら二文字文読んでみる
        if(CharNum + 1 < dic[text,1].Length){
            futamoji = dic[text,1].Substring(CharNum,2);
            nextChar = dic[text,1].Substring(CharNum + 1,1);
            if(nextChar.Equals("あ") | nextChar.Equals("え") | nextChar.Equals("お"))boin = true;
            if(nextChar.Equals("、") | nextChar.Equals("。") | nextChar.Equals("ー") | nextChar.Equals("！") | nextChar.Equals("？"))kigou = true;
            if(nextChar.Equals("な") | nextChar.Equals("に") | nextChar.Equals("ぬ") | nextChar.Equals("ね") | nextChar.Equals("の")
             | nextChar.Equals("ん") | boin )NN = true;
        }
        
        //そもそも二文字分の書き方がない場合は一文字分だけ追加する。
        if( !Henkan.ContainsKey(futamoji) ){

            //今の文字が「っ」の場合で「ltu」で表さなくていい時は先に追加しておく
            if(hitomoji.Equals("っ") && !NN && !kigou){
                //今見てる文字が「っ」だったら
                //Debug.Log("次の頭文字で表せる");
                for(int i = 0; i < Henkan[nextChar].Length; i++){
                    //「う」と「い」は一文字以外で表せる(「っう」は多分「WWU」で書ける)ので免除する
                    if(!(Henkan[nextChar][i].Substring(0,1).Equals("Ｕ") || Henkan[nextChar][i].Substring(0,1).Equals("Ｉ")))
                        str[i] = Henkan[nextChar][i].Substring(0,1);
                    Counter++;
                    //Debug.Log("" + Henkan[]);
                }    
            }

            for(int i = 0; i < Henkan[hitomoji].Length; i++)
                //前の文字が「っ」の時
                if(tu && !backstr.Equals("Ｕ") ){
                    //「い：Ｉ」と「う：Ｕ」の時は除外する
                    if( Henkan[hitomoji][i].Substring(0,1).Equals(backstr) &&
                      !(Henkan[hitomoji][i].Substring(0,1).Equals("Ｕ") || Henkan[hitomoji][i].Substring(0,1).Equals("Ｉ"))){
                        str[Counter + i] = Henkan[hitomoji][i];          
                        //Debug.Log("リストの頭文字[" + i + "] : " + Henkan[hitomoji][i].Substring(0,1));                
                      }

                }
                else str[Counter + i] = Henkan[hitomoji][i];

            if(hitomoji.Equals("ん")){
                //今見てる文字が「ん」でＮＮって打たなきゃいけない時
                if( NN | CharNum + 1 == dic[text,1].Length 
                | nextChar.Equals("い") | nextChar.Equals("う"))str[0] = "ＮＮ";
                else if( CharNum + 1 != dic[text,1].Length && Henkan[nextChar][0].Substring(0,1).Equals("Ｙ"))str[0] = "ＮＮ";
            }
            
            skipChar = false;
            return str;
        }

        //ちゃんと2文字読める状態だったらfirstLengthを更新する。
        kanryakuLength = Henkan[futamoji].Length;

        //組み合わせて作れる文字の場合の文字を追加していく。(拗音とか)
        for(int i = 0; i < kanryakuLength; i++){
            if( tu && !backstr.Equals("Ｕ") ){
                //前のひらがなが「っ」で前に打ったローマ字が頭文字と合ってたら
                if(Henkan[futamoji][i].Substring(0,1).Equals(backstr))
                    str[i] = Henkan[futamoji][i];
            }
            //前の文字が「っ」以外なら普通に全部入れる。
            else str[i] = Henkan[futamoji][i];

            //ここに来たということは2文字分のローマ字を打っているのでtrueにする。
            skipChar = true;
        }
        //if(skipChar)Debug.Log("飛ぶはず");
        //一文字目の書き方を追加していく(拗音)
        for(int i = 0; i < Henkan[hitomoji].Length; i++){
            for(int j = 0; j < Henkan[nextChar].Length; j++){
                if(tu && !backstr.Equals("Ｕ")){
                    //前の文字が「っ」かつ前のローマ字がＵ以外かつ頭文字と同じ
                    if( Henkan[hitomoji][i].Substring(0,1).Equals(backstr) ){
                        str[kanryakuLength + count] = Henkan[hitomoji][i];
                    }
                }
                else str[kanryakuLength + count] = Henkan[hitomoji][i];
                count++;
            }
        }    

        skipChar = true;

        count = 0;

        //２文字目の書き方を追加していく(拗音)
        for(int i = 0; i < Henkan[hitomoji].Length; i++){
            for(int j = 0; j < Henkan[nextChar].Length; j++){
                if(!string.IsNullOrEmpty(str[kanryakuLength + count])){
                    //for(int k = 0)
                    str[kanryakuLength + count] += Henkan[nextChar][j];
                }

                count++;
            }
        }
        skipChar = true;
        
        return str;
    }

    //配列(TrueRomaList)の要素をリセットする。
    void ResetArray(string[] array)
    {
        for(int i = 0; i < array.Length; i++){
            array[i] = "";
        }
        for(int i = 0; i < array.Length; i++){
            if(!string.IsNullOrEmpty(array[i]))Debug.Log("出来てない");
        }
    }

    //今見てる文字が拗音かどうかの判定をするメソッド(もうクソ面倒なので脳死で楽に打てるパターンを全部書く)
    bool IsYouon(string str)
    {
        if(str.Equals("ＹＥ") | str.Equals("ＷＨＡ") | str.Equals("ＷＩ") | str.Equals("ＷＥ") | str.Equals("ＷＨＥ")
         | str.Equals("ＷＨＯ") | str.Equals("ＶＡ") | str.Equals("ＶＩ") | str.Equals("ＶＹＩ") | str.Equals("ＶＥ")
         | str.Equals("ＶＹＥ") | str.Equals("ＶＯ") | str.Equals("ＶＹＡ") | str.Equals("ＶＹＵ") | str.Equals("ＶＹＯ")
         | str.Equals("ＫＹＡ") | str.Equals("ＫＹＩ") | str.Equals("ＫＹＵ") | str.Equals("ＫＹＥ") | str.Equals("ＫＹＯ")
         | str.Equals("ＧＹＡ") | str.Equals("ＧＹＩ") | str.Equals("ＧＹＵ") | str.Equals("ＧＹＥ") | str.Equals("ＧＹＯ")
         | str.Equals("ＳＹＡ") | str.Equals("ＳＨＡ") | str.Equals("ＳＹＩ") | str.Equals("ＳＹＵ") | str.Equals("ＳＨＵ")
         | str.Equals("ＳＹＥ") | str.Equals("ＳＨＥ") | str.Equals("ＳＹＯ") | str.Equals("ＳＨＯ") | str.Equals("ＪＡ")
         | str.Equals("ＪＹＡ") | str.Equals("ＪＹＩ") | str.Equals("ＪＵ") | str.Equals("ＪＹＵ") | str.Equals("ＪＥ")
         | str.Equals("ＪＹＥ") | str.Equals("ＪＯ") | str.Equals("ＪＹＯ") | str.Equals("ＴＹＡ") | str.Equals("ＣＨＡ")
         | str.Equals("ＣＹＡ") | str.Equals("ＴＹＩ") | str.Equals("ＣＹＩ") | str.Equals("ＴＹＵ") | str.Equals("ＣＨＵ")
         | str.Equals("ＣＹＵ") | str.Equals("ＴＹＥ")  | str.Equals("ＣＨＥ") | str.Equals("ＣＹＥ") | str.Equals("ＴＹＥ")
         | str.Equals("ＣＨＥ") | str.Equals("ＣＹＥ") | str.Equals("ＴＹＯ") | str.Equals("ＣＨＯ") | str.Equals("ＣＹＯ")
         | str.Equals("ＤＹＡ") | str.Equals("ＤＹＩ") | str.Equals("ＤＹＵ") | str.Equals("ＤＹＥ") | str.Equals("ＤＹＯ")
         | str.Equals("ＴＨＡ") | str.Equals("ＴＨＩ") | str.Equals("ＴＨＵ") | str.Equals("ＴＨＥ") | str.Equals("ＴＨＯ")
         | str.Equals("ＤＨＡ") | str.Equals("ＤＨＩ") | str.Equals("ＤＨＵ") | str.Equals("ＤＨＥ") | str.Equals("ＤＨＯ")
         | str.Equals("ＮＹＡ") | str.Equals("ＮＹＩ") | str.Equals("ＮＹＵ") | str.Equals("ＮＹＥ") | str.Equals("ＮＹＯ")
         | str.Equals("ＨＹＡ") | str.Equals("ＨＹＩ") | str.Equals("ＨＹＵ") | str.Equals("ＨＹＥ") | str.Equals("ＨＹＯ")
         | str.Equals("ＢＹＡ") | str.Equals("ＢＹＩ") | str.Equals("ＢＹＵ") | str.Equals("ＢＹＥ") | str.Equals("ＢＹＯ")
         | str.Equals("ＰＹＡ") | str.Equals("ＰＹＩ") | str.Equals("ＰＹＵ") | str.Equals("ＰＹＥ") | str.Equals("ＰＹＯ")
         | str.Equals("ＦＡ") | str.Equals("ＦＩ") | str.Equals("ＦＹＩ") | str.Equals("ＦＥ") | str.Equals("ＦＹＥ")
         | str.Equals("ＦＯ") | str.Equals("ＦＹＡ") | str.Equals("ＦＹＵ") | str.Equals("ＦＹＯ") 
         | str.Equals("ＭＹＡ") | str.Equals("ＭＹＩ") | str.Equals("ＭＹＵ") | str.Equals("ＭＹＥ") | str.Equals("ＭＹＯ")
         | str.Equals("ＲＹＡ") | str.Equals("ＲＹＩ") | str.Equals("ＲＹＵ") | str.Equals("ＲＹＥ") | str.Equals("ＲＹＯ")
         | str.Equals("ＺＹＡ") | str.Equals("ＺＹＩ") | str.Equals("ＺＹＵ") | str.Equals("ＺＹＥ") | str.Equals("ＺＹＯ")
        )return true;

        else return false;
    }

}
